Revit 2027 API
AnalysisDisplayDiagramSettings.IsEqual Method
 Compares two diagram settings objects.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	AnalysisDisplayDiagramSettings other
)
Public Function IsEqual (
	other As AnalysisDisplayDiagramSettings
) As Boolean
public:
bool IsEqual(
	AnalysisDisplayDiagramSettings^ other
)
member IsEqual :
        other : AnalysisDisplayDiagramSettings -> bool
Parameters
other AnalysisDisplayDiagramSettings
 Diagram settings object to compare with.
Return Value
Boolean
 True if objects are equal, false otherwise.
See Also
Reference
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace